In [1]:
import sqlite3



# Databases

# Create a database or connect to one
conn = sqlite3.connect('address_book.db')

# Create cursor
c = conn.cursor()

# Create table

c.execute("""CREATE TABLE addresses (
		first_name text,
		last_name text,
		address text,
		city text,
		state text,
		zipcode integer
		)""")

In [4]:
c.execute(""" insert into addresses values ('john','john','john','john','john','1234')
		"""
		)

In [5]:
c.execute('select * from addresses')

## NEW

In [ ]:
import sqlite3

# Connecting to sqlite
# connection object
connection_obj = sqlite3.connect('db/geek.db')

# cursor object
cursor_obj = connection_obj.cursor()

connection_obj.execute("""CREATE TABLE GEEK(
Email varchar(255),
Name varchar(50),
Score int
);""")

connection_obj.execute(
	"""INSERT INTO GEEK (Email,Name,Score) VALUES ("geekk1@gmail.com","Geek1",25)""")
connection_obj.execute(
	"""INSERT INTO GEEK (Email,Name,Score) VALUES ("geekk2@gmail.com","Geek2",15)""")
connection_obj.execute(
	"""INSERT INTO GEEK (Email,Name,Score) VALUES ("geekk3@gmail.com","Geek3",36)""")
connection_obj.execute(
	"""INSERT INTO GEEK (Email,Name,Score) VALUES ("geekk4@gmail.com","Geek4",27)""")
connection_obj.execute(
	"""INSERT INTO GEEK (Email,Name,Score) VALUES ("geekk5@gmail.com","Geek5",40)""")
connection_obj.execute(
	"""INSERT INTO GEEK (Email,Name,Score) VALUES ("geekk6@gmail.com","Geek6",36)""")
connection_obj.execute(
	"""INSERT INTO GEEK (Email,Name,Score) VALUES ("geekk7@gmail.com","Geek7",27)""")

connection_obj.commit()

# Close the connection
connection_obj.close()

In [ ]:
import sqlite3

# Connecting to sqlite
# connection object
connection_obj = sqlite3.connect('db/geek.db')

# cursor object
cursor_obj = connection_obj.cursor()

# to select all column we will use
statement = '''SELECT * FROM GEEK'''

cursor_obj.execute(statement)

print("All the data")
output = cursor_obj.fetchall()
for row in output:
    print(row)

connection_obj.commit()

# Close the connection
connection_obj.close()

In [ ]:

import sqlite3

# Connecting to sqlite
# connection object
connection_obj = sqlite3.connect('db/geek.db')

# cursor object
cursor_obj = connection_obj.cursor()
connection_obj.execute(
	"""INSERT INTO GEEK (Email,Name,Score) VALUES ("geekk6@gmail.com","Geek6",36)""")
connection_obj.execute(
	"""INSERT INTO GEEK (Email,Name,Score) VALUES ("geekk7@gmail.com","Geek7",27)""")

In [ ]:

import sqlite3

# Connecting to sqlite
# connection object
connection_obj = sqlite3.connect('db/geek.db', timeout=10)

# cursor object
cursor_obj = connection_obj.cursor()

connection_obj.execute(
	"""INSERT INTO GEEK (Email,Name,Score) VALUES ("geekk145@gmail.com","Geek145",2545)""")

In [ ]:
while True:
    connection = sqlite3.connect('geek.db', timeout=1)
    cursor = connection.cursor()
    try:
        cursor.execute("SELECT * FROM GEEK;")
        result = cursor.fetchall()
    except sqlite3.OperationalError:
        print("database locked")
    num_users = len(result)

In [14]:
import pandas as pd 
import sqlite3
conn = sqlite3.connect('address_book.db')

df = pd.read_sql_query("SELECT * FROM addresses", conn)

In [6]:
df_list = df.values.tolist()

In [15]:
df

  first_name last_name  address  city state  zipcode
0       john      john     john  john  john   1234.0
1    john123   john123  john134  john  john   1234.0
2    john123   john123  john134  john  john   1234.0
3      Geek6      None     None  None  None      NaN

In [ ]:
df = pandas.read_csv(csvfile)
df.to_sql(table_name, conn, if_exists='append', index=False)